;;; selectrum et al
(package! embark :pin "9e2c04f9bc21b7ab0f0dee19ccfa1c56c8d3147b")
(package! embark-consult :pin "9e2c04f9bc21b7ab0f0dee19ccfa1c56c8d3147b")
(package! selectrum :pin "3c92dbb7b6b52f6ad0a4e3d892faf2f866e2726c")
(package! selectrum-prescient :pin "8573df977eaceffc6607b7242ff8c0dab02aad65")
(package! marginalia :pin "e741b243b30f6cfe85e568cc551acff9a1e5e74f")
(package! consult :pin "70b795e948a52499722c244708db84d1d22f09cf")
(package! orderless :pin "9d5b95f40275dc47a57e9d4ee9b9994ee3a4b426")
(package! prescient :pin "8573df977eaceffc6607b7242ff8c0dab02aad65")
